code-review/NRB_3471_3546/База_Было/DataProcessors/ОтправкаКомиссийВБэкОфис.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ОтправкаКомиссийВБэкОфис</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Комиссии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Комиссия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УслугиТарифногоПлана</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодБэк</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>20</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НачисленияПоДоговорам</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Депонент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комиссия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УслугиТарифногоПлана</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>20</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодРасчета</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выгодоприобретатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Субклиенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДокументыСКомиссиями</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДанныеПоКомиссиям</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Регистратор</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодВалюты</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>3</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комиссия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УслугиТарифногоПлана</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодКомиссии</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>5</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеКомиссии</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НДСКомиссии</Name>
							<Type>
								<v8:Type>cfg:EnumRef.НДСКомиссии</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеДоговора</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодРасчета</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Период</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСтрокиВРегистре</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>CrmClientId</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлиентОтсутствуетВBQ</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БезАкцептноеСписание</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСчетаСписанияКомиссии</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Documents/УслугиДепозитария.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>УслугиДепозитария</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УслугиДепозитария</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Комментарий100</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проверка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВсего</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТарифныйПлан</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТарифныеПланы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРасчетаКомиссии</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидОперации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыОпераций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МестоХранения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСделки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тариф</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипТарифа</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыТарифов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УслугиТарифногоПлана</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаКомиссии</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>20</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выгодоприобретатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Субклиенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/DataProcessors/ОтправкаКомиссийВБэкОфис/Ext/ObjectModule.bsl
Процедура Сформировать() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УслугиДепозитарияОбороты.Регистратор КАК Регистратор,
	|	УслугиДепозитарияОбороты.Валюта КАК Валюта,
	|	УслугиДепозитарияОбороты.Услуга КАК Комиссия,
	|	УслугиТарифногоПлана.Код КАК КодКомиссии,
	|	УслугиТарифногоПлана.Наименование КАК НаименованиеКомиссии,
	|	УслугиТарифногоПлана.НДС КАК НДСКомиссии,
	|	УслугиТарифногоПлана.КодВБэкОфисе КАК КодВБэкОфисе,
	|	ВЫБОР
	|		КОГДА УслугиДепозитарияОбороты.Регистратор ССЫЛКА Документ.УслугиДепозитария
	|				И УслугиДепозитарияОбороты.Регистратор.ПериодРасчетаКомиссии <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА УслугиДепозитарияОбороты.Регистратор.ПериодРасчетаКомиссии
	|		ИНАЧЕ НАЧАЛОПЕРИОДА(УслугиДепозитарияОбороты.Период, ДЕНЬ)
	|	КОНЕЦ КАК ПериодРасчета,
	|	УслугиДепозитарияОбороты.СуммаВВалютеПриход КАК Сумма,
	|	УслугиДепозитарияОбороты.Период КАК Период,
	|	УслугиДепозитарияОбороты.НомерСтроки КАК НомерСтрокиВРегистре,
	|	ЕСТЬNULL(КодыЗагрузки.Код, """") КАК CrmClientId,
	|	УслугиДепозитарияОбороты.Инициатор КАК Инициатор,
	|	УслугиДепозитарияОбороты.Инициатор.Владелец КАК ИнициаторВладелец,
	|	УслугиДепозитарияОбороты.Инициатор.Наименование КАК НаименованиеДоговора,
	|	УслугиДепозитарияОбороты.Выгодоприобретатель КАК Выгодоприобретатель,
	|	Контрагенты.КлиентОтсутствуетВBQ КАК КлиентОтсутствуетВBQ,
	|	Контрагенты.СчетСписанияКомиссииВНРБанке КАК НомерСчетаСписанияКомиссии
	|ПОМЕСТИТЬ ДанныеПоУслугамДепозитария
	|ИЗ
	|	РегистрНакопления.УслугиДепозитария.Обороты(&НачалоПериода, &КонецПериода, Запись, ) КАК УслугиДепозитарияОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КодыЗагрузки КАК КодыЗагрузки
	|			ПО Контрагенты.ЮридическиеФизическиеЛица = КодыЗагрузки.Владелец
	|				И (НЕ КодыЗагрузки.ПометкаУдаления)
	|				И (КодыЗагрузки.Биржа = &КлассификаторыЗагрузкиКлиенты)
	|		ПО УслугиДепозитарияОбороты.Инициатор.Владелец = Контрагенты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УслугиТарифногоПлана КАК УслугиТарифногоПлана
	|		ПО УслугиДепозитарияОбороты.Услуга = УслугиТарифногоПлана.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УслугиДепозитарияВыгруженные КАК УслугиДепозитарияВыгруженные
	|		ПО УслугиДепозитарияОбороты.Регистратор = УслугиДепозитарияВыгруженные.Документ
	|ГДЕ
	|	УслугиДепозитарияОбороты.СуммаВВалютеОборот <> 0
	|	И УслугиДепозитарияВыгруженные.Документ ЕСТЬ NULL
	|	И ВЫБОР
	|			КОГДА Контрагенты.КлиентОтсутствуетВBQ
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ НЕ КодыЗагрузки.Код ЕСТЬ NULL
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПредоставленныеДокументыСрезПоследних.Депонент КАК Депонент,
	|	ПредоставленныеДокументыСрезПоследних.Период КАК НачалоПериода,
	|	ВЫБОР
	|		КОГДА ПредоставленныеДокументыСрезПоследних.СрокДействия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ПредоставленныеДокументыСрезПоследних.СрокДействия
	|		ИНАЧЕ КОНЕЦПЕРИОДА(ПредоставленныеДокументыСрезПоследних.СрокДействия, ДЕНЬ)
	|	КОНЕЦ КАК ОкончаниеПериода
	|ПОМЕСТИТЬ ПериодыПредоставленияДокументов
	|ИЗ
	|	РегистрСведений.ПредоставленныеДокументы.СрезПоследних(
	|			&НачалоПериода,
	|			ВидДокумента = ЗНАЧЕНИЕ(Справочник.ВидыДокументовУдостоверяющихПолномочия.ЗаявлениеНаРегулярноеПеречисление)
	|				И Депонент В
	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						ДанныеПоУслугамДепозитария.ИнициаторВладелец КАК ИнициаторВладелец
	|					ИЗ
	|						ДанныеПоУслугамДепозитария КАК ДанныеПоУслугамДепозитария)) КАК ПредоставленныеДокументыСрезПоследних
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПредоставленныеДокументы.Депонент,
	|	ПредоставленныеДокументы.Период,
	|	ВЫБОР
	|		КОГДА ПредоставленныеДокументы.СрокДействия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ПредоставленныеДокументы.СрокДействия
	|		ИНАЧЕ КОНЕЦПЕРИОДА(ПредоставленныеДокументы.СрокДействия, ДЕНЬ)
	|	КОНЕЦ
	|ИЗ
	|	ДанныеПоУслугамДепозитария КАК ДанныеПоУслугамДепозитария
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПредоставленныеДокументы КАК ПредоставленныеДокументы
	|		ПО ДанныеПоУслугамДепозитария.ИнициаторВладелец = ПредоставленныеДокументы.Депонент
	|			И (ПредоставленныеДокументы.Период МЕЖДУ &НачалоПериода И &КонецПериода)
	|			И (ПредоставленныеДокументы.ВидДокумента = ЗНАЧЕНИЕ(Справочник.ВидыДокументовУдостоверяющихПолномочия.ЗаявлениеНаРегулярноеПеречисление))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеПоУслугамДепозитария.Комиссия КАК Комиссия,
	|	ДанныеПоУслугамДепозитария.Валюта КАК Валюта,
	|	СУММА(ДанныеПоУслугамДепозитария.Сумма) КАК Сумма,
	|	ДанныеПоУслугамДепозитария.КодВБэкОфисе КАК КодВБэкОфисе
	|ИЗ
	|	ДанныеПоУслугамДепозитария КАК ДанныеПоУслугамДепозитария
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеПоУслугамДепозитария.КодВБэкОфисе,
	|	ДанныеПоУслугамДепозитария.Валюта,
	|	ДанныеПоУслугамДепозитария.Комиссия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеПоУслугамДепозитария.Комиссия КАК Комиссия,
	|	ДанныеПоУслугамДепозитария.Валюта КАК Валюта,
	|	СУММА(ДанныеПоУслугамДепозитария.Сумма) КАК Сумма,
	|	ДанныеПоУслугамДепозитария.КодВБэкОфисе КАК КодБэк,
	|	ДанныеПоУслугамДепозитария.Инициатор КАК Договор,
	|	ДанныеПоУслугамДепозитария.ИнициаторВладелец КАК Депонент,
	|	ВЫБОР
	|		КОГДА ДанныеПоУслугамДепозитария.Регистратор ССЫЛКА Документ.УслугиДепозитария
	|				И ДанныеПоУслугамДепозитария.Регистратор.ПериодРасчетаКомиссии <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ДанныеПоУслугамДепозитария.Регистратор.ПериодРасчетаКомиссии
	|		ИНАЧЕ НАЧАЛОПЕРИОДА(ДанныеПоУслугамДепозитария.Период, ДЕНЬ)
	|	КОНЕЦ КАК ПериодРасчета,
	|	ДанныеПоУслугамДепозитария.Выгодоприобретатель КАК Выгодоприобретатель
	|ИЗ
	|	ДанныеПоУслугамДепозитария КАК ДанныеПоУслугамДепозитария
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеПоУслугамДепозитария.Комиссия,
	|	ДанныеПоУслугамДепозитария.Валюта,
	|	ДанныеПоУслугамДепозитария.КодВБэкОфисе,
	|	ВЫБОР
	|		КОГДА ДанныеПоУслугамДепозитария.Регистратор ССЫЛКА Документ.УслугиДепозитария
	|				И ДанныеПоУслугамДепозитария.Регистратор.ПериодРасчетаКомиссии <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ДанныеПоУслугамДепозитария.Регистратор.ПериодРасчетаКомиссии
	|		ИНАЧЕ НАЧАЛОПЕРИОДА(ДанныеПоУслугамДепозитария.Период, ДЕНЬ)
	|	КОНЕЦ,
	|	ДанныеПоУслугамДепозитария.Выгодоприобретатель,
	|	ДанныеПоУслугамДепозитария.Инициатор,
	|	ДанныеПоУслугамДепозитария.ИнициаторВладелец
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеПоУслугамДепозитария.Регистратор КАК Регистратор,
	|	ДанныеПоУслугамДепозитария.Валюта.Код КАК КодВалюты,
	|	УслугиТарифногоПлана.Ссылка КАК Комиссия,
	|	УслугиТарифногоПлана.Код КАК КодКомиссии,
	|	УслугиТарифногоПлана.Наименование КАК НаименованиеКомиссии,
	|	УслугиТарифногоПлана.НДС КАК НДСКомиссии,
	|	ЕСТЬNULL(КодыЗагрузки.Код, ДанныеПоУслугамДепозитария.НаименованиеДоговора) КАК НаименованиеДоговора,
	|	ДанныеПоУслугамДепозитария.ПериодРасчета КАК ПериодРасчета,
	|	ДанныеПоУслугамДепозитария.Сумма КАК Сумма,
	|	ДанныеПоУслугамДепозитария.Период КАК Период,
	|	ДанныеПоУслугамДепозитария.НомерСтрокиВРегистре КАК НомерСтрокиВРегистре,
	|	ДанныеПоУслугамДепозитария.CrmClientId КАК CrmClientId,
	|	ДанныеПоУслугамДепозитария.КлиентОтсутствуетВBQ КАК КлиентОтсутствуетВBQ,
	|	ДанныеПоУслугамДепозитария.НомерСчетаСписанияКомиссии КАК НомерСчетаСписанияКомиссии,
	|	ВЫБОР
	|		КОГДА ДанныеПоУслугамДепозитария.КлиентОтсутствуетВBQ
	|				И ПериодыПредоставленияДокументов.Депонент ЕСТЬ НЕ NULL 
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК БезАкцептноеСписание
	|ИЗ
	|	ДанныеПоУслугамДепозитария КАК ДанныеПоУслугамДепозитария
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.УслугиТарифногоПлана КАК УслугиТарифногоПлана
	|		ПО ДанныеПоУслугамДепозитария.Комиссия = УслугиТарифногоПлана.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПериодыПредоставленияДокументов КАК ПериодыПредоставленияДокументов
	|		ПО ДанныеПоУслугамДепозитария.ИнициаторВладелец = ПериодыПредоставленияДокументов.Депонент
	|			И ДанныеПоУслугамДепозитария.Период >= ПериодыПредоставленияДокументов.НачалоПериода
	|			И (ДанныеПоУслугамДепозитария.Период <= ПериодыПредоставленияДокументов.ОкончаниеПериода
	|				ИЛИ ПериодыПредоставленияДокументов.ОкончаниеПериода = ДАТАВРЕМЯ(1, 1, 1))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КодыЗагрузки КАК КодыЗагрузки
	|		ПО ДанныеПоУслугамДепозитария.ИнициаторВладелец = КодыЗагрузки.Владелец
	|			И (КодыЗагрузки.Биржа = ЗНАЧЕНИЕ(Справочник.КлассификаторыЗагрузки.CrmContractNumber))
	|			И (НЕ КодыЗагрузки.ПометкаУдаления)
	|			И (ВЫБОР
	|				КОГДА КодыЗагрузки.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	|					ТОГДА ИСТИНА
	|				КОГДА КодыЗагрузки.ДатаОкончанияДействия >= &НачалоПериода
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеПоУслугамДепозитария.Регистратор КАК Документ,
	|	ДанныеПоУслугамДепозитария.Регистратор.Номер КАК Номер,
	|	ДанныеПоУслугамДепозитария.Регистратор.Дата КАК Дата,
	|	ДанныеПоУслугамДепозитария.Период КАК Период,
	|	СУММА(ДанныеПоУслугамДепозитария.Сумма) КАК Сумма
	|ИЗ
	|	ДанныеПоУслугамДепозитария КАК ДанныеПоУслугамДепозитария
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеПоУслугамДепозитария.Период,
	|	ДанныеПоУслугамДепозитария.Регистратор,
	|	ДанныеПоУслугамДепозитария.Регистратор.Номер,
	|	ДанныеПоУслугамДепозитария.Регистратор.Дата
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период";
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(КонецПериода));
	Запрос.УстановитьПараметр("КлассификаторыЗагрузкиКлиенты", Справочники.КлассификаторыЗагрузки.Клиенты);
	
	Пакеты = Запрос.ВыполнитьПакет();
	
	Комиссии.Загрузить(Пакеты[2].Выгрузить());
	НачисленияПоДоговорам.Загрузить(Пакеты[3].Выгрузить());
	ДанныеПоКомиссиям.Загрузить(Пакеты[4].Выгрузить());
	ДокументыСКомиссиями.Загрузить(Пакеты[5].Выгрузить());
	
КонецПроцедуры

Процедура ОтправитьВБэкОфис() Экспорт
	
	Отбор = Новый Структура("Регистратор");
	
	Для Каждого ДанныеРегистратора Из ДокументыСКомиссиями Цикл
		
		Отбор.Регистратор = ДанныеРегистратора.Документ;
		ЗаписиПоКомиссиям = ДанныеПоКомиссиям.НайтиСтроки(Отбор);
		
		ТекстыJSON = ТекстыПоСтрокамДокумента(ДанныеРегистратора, ЗаписиПоКомиссиям);
		Если ЗначениеЗаполнено(ТекстыJSON) Тогда
			
			Если ЗаписиПоКомиссиям[0].КлиентОтсутствуетВBQ Тогда
				ВнешнийИсточник = ПланыВидовХарактеристик.ВнешниеИсточники.KafkaDepoToDiasCommissionIn1642;
			Иначе
				ВнешнийИсточник = ПланыВидовХарактеристик.ВнешниеИсточники.KafkaDepoComissions;
			КонецЕсли;
			
			Для Каждого СтруктураТекстаJSON Из ТекстыJSON Цикл
				ТекстJSON = СтруктураТекстаJSON.Значение;
				Идентификатор = СтруктураТекстаJSON.Представление;
				ОбменДаннымиКафка.ЗаписатьДанныеНабораЗаписиВИсходящиеСообщенияКафка(
				ТекстJSON, ВнешнийИсточник, Идентификатор, ДанныеРегистратора.Документ);
			КонецЦикла;
			
			РегистрыСведений.УслугиДепозитарияВыгруженные.Добавить(ДанныеРегистратора.Документ);
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ТекстыПоСтрокамДокумента(ДанныеРегистратора, ЗаписиПоКомиссиям)
	
	Если ЗаписиПоКомиссиям[0].КлиентОтсутствуетВBQ Тогда
		
		Если ЗаписиПоКомиссиям[0].БезАкцептноеСписание И Не ЗначениеЗаполнено(ЗаписиПоКомиссиям[0].НомерСчетаСписанияКомиссии) Тогда
			ТекстОшибки = СтрШаблон("Не указан счет списания депозитарной комиссии в НРБанке у клиента %1",
			ЗаписиПоКомиссиям[0].НаименованиеДоговора);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
			Возврат Неопределено;
		КонецЕсли;
		
		ТекстыJSON = ОбменДаннымиКафка.УслугиДепозитарияТолькоДепозитарноеОбслуживаниеТекстыJSON(ДанныеРегистратора, ЗаписиПоКомиссиям);
	Иначе
		ТекстыJSON = ОбменДаннымиКафка.УслугиДепозитарияТекстыJSON(ДанныеРегистратора, ЗаписиПоКомиссиям);
	КонецЕсли;
	
	Возврат ТекстыJSON;
	
КонецФункции

ОбщегоНазначения.ЛогироватьИспользованиеОбъекта(ЭтотОбъект);
